#include <REGX52.H>
#include "NixieTube.h"

//################################################################
//##
//##                     把一位数码管的值（显示图案）编成数组
//##
//################################################################
//可以将数码管的显示图案对应的十六进制数
//编成一个数组来方便地控制其显示
unsigned char NixieTable[] = {
    0x3f, // 0 
    0x06, // 1 
    0x5b, // 2
    0x4f, // 3
    0x66, // 4
    0x6d, // 5
    0x7d, // 6
    0x07, // 7
    0x7f, // 8
    0x6f, // 9
    0x77, // A
    0x7c, // b
    0x39, // C
    0x5e, // d
    0x79, // E
    0x71, // F
    0x00, // 空
};

//###########################################################
//##
//##                     一位数码管显示函数
//##
//###########################################################
//第一位参数是数码管的位置，第二位参数是要显示的数字图案
void Display_NixieTube(unsigned char Location, unsigned char Number){
    //注意了，C语言的函数没有默认值，C++才有
    
    switch (Location){//用switch循环设置公共端，来选定数码管的哪一位亮
        case 1: //选中第一位数码管
            P2_4 = 1; 
            P2_3 = 1; 
            P2_2 = 1;
            
            break;
        case 2: //选中第二位数码管
            P2_4 = 1; 
            P2_3 = 1; 
            P2_2 = 0;
            
            break;

        case 3: //选中第三位数码管
            P2_4 = 1; 
            P2_3 = 0; 
            P2_2 = 1;
            
            break;

        case 4: //选中第四位数码管
            P2_4 = 1; 
            P2_3 = 0; 
            P2_2 = 0;
            
            break;

        case 5: //选中第五位数码管
            P2_4 = 0;
            P2_3 = 1;
            P2_2 = 1;
            
            break;

        case 6: //选中第六位数码管
            P2_4 = 0;
            P2_3 = 1;
            P2_2 = 0;
            
            break;
        
        case 7: //选中第七位数码管
            P2_4 = 0;
            P2_3 = 0;
            P2_2 = 1;
            
            break;

        case 8: //选中第八位数码管
            P2_4 = 0;
            P2_3 = 0;
            P2_2 = 0;
            
            break;
    }

    //把数码管那一位的显示图案对应的16进制数编成一个数组来方便的控制
    P0 =NixieTable[Number];
    //延时一段时间，让人眼能看到
    Delay1ms(1);
    //一般延时<1ms就可以了，如果延时太长，会看到数码管闪烁

    //把位选端口全部置0，关闭数码管
    P0 = 0x00;
}
