#include <REGX52.H>
#include <INTRINS.H>

//#################################################################################
//##
//##                                        演示延时函数
//##
//#################################################################################
void Delay1ms( unsigned int Xms){   
    //使用某个软件，根据特定单片机开发板上的晶振频率，生成的相应的延时函数
    //这是@11.0592MHz的延时1ms函数
    //利用写死的延迟1ms，传入Xms参数进行给定次的循环，实现任意个以1ms为单位的延迟函数
    unsigned char i, j; 
    while(Xms){
        _nop_();
        _nop_();
        _nop_();
        i = 11;
        j = 190;
        do{
            while (--j);
        } while (--i);
        --Xms;
    }
}

//#################################################################################
//##
//##                                    位运算符实现亮点移动
//##
//#################################################################################
void LED_flow(){
    //0000 0001
    //0000 0010
    //0000 0100
    //0000 1000
    //0001 0000
    //0010 0000
    //0100 0000
    //1000 0000
    //0000 0000
    //结束循环，从头开始
}



//#################################################################################
//##
//##                                一次性赋8位二进制值给寄存器
//##
//#################################################################################
void main(){
    while(1){
        //把一个16进制数直接整体赋值给一个8位寄存器
        //那个寄存器的某一位的值是0或1决定了某一个回路是否通电
        //这样就可以实现8个回路的灯的亮灭

        P2 = 0xFE; //1111 1110   
        Delay1ms(200);      

        P2 = 0xFD; //1111 1101      
        Delay1ms(200);   

        P2 = 0xFB; //1111 1011  
        Delay1ms(200);  

        P2 = 0xF7; //1111 0111   
        Delay1ms(200);  

        P2 = 0xEF; //1110 1111     
        Delay1ms(200);   

        P2 = 0xDF; //1101 1111    
        Delay1ms(200); 

        P2 = 0xBF; //1011 1111
        Delay1ms(200);    

        P2 = 0x7F; //0111 1111 
        Delay1ms(200);
    }
}